loja/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('alimentos', '2009-05-09 17:50:38', '2009-05-09 17:50:38')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2009-05-09 17:53:02', "name" = 'alimentos alimentos' WHERE "id" = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
DELETE FROM "categories" WHERE "id" = 2
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy