loja/app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "category_id", "description") VALUES('tes', 1.0, '2009-05-09 20:05:04', '2009-05-09 20:05:04', 1, 'testet')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 3)
UPDATE "products" SET "updated_at" = '2009-05-16 17:26:51', "photo_file_name" = 'pq21435748.jpg', "name" = 'notebook', "photo_file_size" = 5022, "category_id" = 3, "photo_content_type" = 'image/jpeg' WHERE "id" = 2
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 1)
DELETE FROM "products" WHERE "id" = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy