loja/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "login", "password") VALUES('2009-05-16 18:05:58', '2009-05-16 18:05:58', 'teste', '123')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save